# Introducing Pandas

- Sections

- Introduction to Pandas

- Creating and Loading Data

- Exploring DataFrames

- Data Cleaning

- Visualization with Pandas

- Data Analysis

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

# 1. Creating a DataFrame from a Dictionary

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Garnet', 'Hannah'],
    'Age': [24, 27, 22, 32, 29, 45, 33, 23],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Chicago', 'New York', 'Houston'],
    'Salary': [70000, 80000, 50000, 120000, 75000, 150000, 234092, 43223]
}
data_df = pd.DataFrame(data)
print("\n--- DataFrame ---\n\n")
data_df

--- DataFrame ---

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   50000
3    David   32      Houston  120000
4      Eve   29      Phoenix   75000
5    Frank   45      Chicago  150000
6   Garnet   33     New York  234092
7   Hannah   23      Houston   43223

In [8]:
data_df.describe()

            Age         Salary
count   8.00000       8.000000
mean   29.37500  102789.375000
std     7.50119   63770.847896
min    22.00000   43223.000000
25%    23.75000   65000.000000
50%    28.00000   77500.000000
75%    32.25000  127500.000000
max    45.00000  234092.000000

In [ ]:
i += 1

In [13]:
#Dropping Columns
data_df['Bonus'] = data_df['Salary'] * 0.1  # New column
#data_df

data_df.drop(columns=['Bonus'], inplace=True)  # Dropping a column
#data_df
#data_df['Bonus'] = None
data_df

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   50000
3    David   32      Houston  120000
4      Eve   29      Phoenix   75000
5    Frank   45      Chicago  150000
6   Garnet   33     New York  234092
7   Hannah   23      Houston   43223

In [15]:
#Renaming Columns
data_df.rename(columns={'Salary': 'Annual_Income', 'City':'Location'}, inplace=True)

In [17]:
#Seeing duplicates in the DataFrame
data_df.duplicated().sum()  # Count duplicates

0

In [18]:
data_df.drop_duplicates(inplace=True)  # Remove duplicates

In [31]:
#Merging Data Frames using pd.merge
df2 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Jerry'], 'Department': ['HR', 'Finance', 'HR']})
df2

merged_df = pd.merge(data_df, df2, on='Name', how='outer')

In [32]:
merged_df

      Name   Age     Location  Annual_Income Department
0    Alice  24.0     New York        70000.0         HR
1      Bob  27.0  Los Angeles        80000.0    Finance
2  Charlie  22.0      Chicago        50000.0        NaN
3    David  32.0      Houston       120000.0        NaN
4      Eve  29.0      Phoenix        75000.0        NaN
5    Frank  45.0      Chicago       150000.0        NaN
6   Garnet  33.0     New York       234092.0        NaN
7   Hannah  23.0      Houston        43223.0        NaN
8    Jerry   NaN          NaN            NaN         HR

In [21]:
merged_df

      Name  Age     Location  Annual_Income Department
0    Alice   24     New York          70000         HR
1      Bob   27  Los Angeles          80000    Finance
2  Charlie   22      Chicago          50000        NaN
3    David   32      Houston         120000        NaN
4      Eve   29      Phoenix          75000        NaN
5    Frank   45      Chicago         150000        NaN
6   Garnet   33     New York         234092        NaN
7   Hannah   23      Houston          43223        NaN

In [33]:
#merging DataFrames using pd.concat
new_data = pd.DataFrame({'Name': ['Frank'], 'Age': [26], 'City': ['Boston'], 'Salary': [68000]})
df = pd.concat([data_df, new_data], ignore_index=True)

In [34]:
df

      Name  Age     Location  Annual_Income    City   Salary
0    Alice   24     New York        70000.0     NaN      NaN
1      Bob   27  Los Angeles        80000.0     NaN      NaN
2  Charlie   22      Chicago        50000.0     NaN      NaN
3    David   32      Houston       120000.0     NaN      NaN
4      Eve   29      Phoenix        75000.0     NaN      NaN
5    Frank   45      Chicago       150000.0     NaN      NaN
6   Garnet   33     New York       234092.0     NaN      NaN
7   Hannah   23      Houston        43223.0     NaN      NaN
8    Frank   26          NaN            NaN  Boston  68000.0

In [37]:
data_df.groupby('Location').agg({'Age': ['mean', 'max', 'min']})

              Age
             mean max min
Location
Chicago      33.5  45  22
Houston      27.5  32  23
Los Angeles  27.0  27  27
New York     28.5  33  24
Phoenix      29.0  29  29

# 2. Loading Data from a CSV file (example)

In [38]:
df = pd.read_csv('Boston.csv')

In [39]:
df.head()

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,9.14,21.6
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,4.03,34.7
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,2.94,33.4
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,5.33,36.2

In [40]:
df = pd.read_csv('Boston.csv', index_col=0)

In [41]:
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,4.98,24.0
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,9.14,21.6
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,4.03,34.7
4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,2.94,33.4
5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,5.33,36.2

In [51]:
df.iloc[[0, 1, 2, 3], [4, 0]]

     nox     crim
1  0.538  0.00632
2  0.469  0.02731
3  0.469  0.02729
4  0.458  0.03237

In [47]:
df.loc[[1, 2, 3, 4], ['nox', 'crim']]

     nox     crim
1  0.538  0.00632
2  0.469  0.02731
3  0.469  0.02729
4  0.458  0.03237

## 2.1 Loading in .txt files

In [58]:
df_txt = pd.read_csv("Masses_V2_Table.txt", sep = r"\s+", index_col = 0)

In [59]:
df_txt.head()

           Mass Survey
61226  7.998931  CEERS
61124  7.928842  CEERS
10601  7.547774  CEERS
15824  7.928763  CEERS
18264  8.786297  CEERS

In [62]:
df_txt.iloc[2]

Mass      7.547774
Survey       CEERS
Name: 10601, dtype: object

# Adding in a row with some NaNs in the DataFrame for later analysis

In [63]:
new_row = pd.DataFrame(np.array([0.004, 12, 0, .432, 
              4.56, 54.1, 5.42, 4, 
              3, 210, np.nan, np.nan, np.nan]).reshape(1, -1), columns = df.columns.values, index = [3456453])

merge_df = pd.concat([df, new_row])

In [64]:
merge_df.tail()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
503,0.04527,0.0,11.93,0.000,0.573,6.120,76.70,2.2875,1.0,273.0,21.0,9.08,20.6
504,0.06076,0.0,11.93,0.000,0.573,6.976,91.00,2.1675,1.0,273.0,21.0,5.64,23.9
505,0.10959,0.0,11.93,0.000,0.573,6.794,89.30,2.3889,1.0,273.0,21.0,6.48,22.0
506,0.04741,0.0,11.93,0.000,0.573,6.030,80.80,2.5050,1.0,273.0,21.0,7.88,11.9
3456453,0.00400,12.0,0.00,0.432,4.560,54.100,5.42,4.0000,3.0,210.0,NaN,NaN,NaN

# 3. Exploring the DataFrame

In [65]:
print("\nData Types:\n", df.dtypes)

Data Types:
 crim       float64
zn         float64
indus      float64
chas         int64
nox        float64
rm         float64
age        float64
dis        float64
rad          int64
tax          int64
ptratio    float64
lstat      float64
medv       float64
dtype: object

In [66]:
print("\nSummary Statistics:\n")
df.describe()

Summary Statistics:

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,12.653063,22.532806
std,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,11.360000,21.200000
75%,3.677083,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,37.970000,50.000000

In [67]:
print("\nFirst 3 Rows:\n")
df.head(3)

First 3 Rows:

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,4.98,24.0
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,9.14,21.6
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,4.03,34.7

# 4. Data Cleaning (Handling Missing Values)

In [68]:
#code to determine if there are NaNs in the columns and how many are there
df.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

In [69]:
merge_df.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    1
lstat      1
medv       1
dtype: int64

In [70]:
#Ways to handle NaNs
#1. Drop the rows with NaNs
df_no_missing = merge_df.dropna()
df_no_missing.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

In [71]:
#2. Fill NaNs with a specific value
df_fill = merge_df.fillna(0)
df_fill.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

In [72]:
df_fill.tail()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
503,0.04527,0.0,11.93,0.000,0.573,6.120,76.70,2.2875,1.0,273.0,21.0,9.08,20.6
504,0.06076,0.0,11.93,0.000,0.573,6.976,91.00,2.1675,1.0,273.0,21.0,5.64,23.9
505,0.10959,0.0,11.93,0.000,0.573,6.794,89.30,2.3889,1.0,273.0,21.0,6.48,22.0
506,0.04741,0.0,11.93,0.000,0.573,6.030,80.80,2.5050,1.0,273.0,21.0,7.88,11.9
3456453,0.00400,12.0,0.00,0.432,4.560,54.100,5.42,4.0000,3.0,210.0,0.0,0.00,0.0

In [73]:
#3. Fill NaNs with the mean of the column
df_mean = merge_df.fillna(df.mean())
df_mean.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

In [74]:
df_mean.tail()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,lstat,medv
503,0.04527,0.0,11.93,0.000,0.573,6.120,76.70,2.2875,1.0,273.0,21.000000,9.080000,20.600000
504,0.06076,0.0,11.93,0.000,0.573,6.976,91.00,2.1675,1.0,273.0,21.000000,5.640000,23.900000
505,0.10959,0.0,11.93,0.000,0.573,6.794,89.30,2.3889,1.0,273.0,21.000000,6.480000,22.000000
506,0.04741,0.0,11.93,0.000,0.573,6.030,80.80,2.5050,1.0,273.0,21.000000,7.880000,11.900000
3456453,0.00400,12.0,0.00,0.432,4.560,54.100,5.42,4.0000,3.0,210.0,18.455534,12.653063,22.532806

In [75]:
#4. Fill NaNs with the median of the column
df_median = merge_df.fillna(df.median())
df_median.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

In [76]:
#5. Fill NaNs with the mode of the column
df_mode = merge_df.fillna(df.mode().iloc[0])
df_mode.isna().sum()

crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
lstat      0
medv       0
dtype: int64

# 5. Filtering and Sorting

In [ ]:
#Boolaen Masking to Filter the DataFrame
df_filtered = df[df['dis'] < 2]
print("\nFiltered Data (dis < 1):\n")
df_filtered

In [ ]:
#Sorting the data by the column dis and it is in reverse order where the largest value is at the top
df.sort_values(by = 'dis', ascending = False)

In [ ]:
#Sorting the data by the column dis and it is in ascending order where the smallest value is at the top
df.sort_values(by = 'dis', ascending = True)

# 6. Visualization with Pandas

In [ ]:
df.plot(x='indus', y='crim', kind='scatter', title='Crime vs Industry')
plt.show()

In [ ]:
df.plot(x='indus', y='crim', kind='scatter', title='Crime vs Industry')
plt.xlabel('Industry')
plt.ylabel('Crime')
plt.show()

In [25]:
features_df = pd.read_csv('Features_with_Continuum.txt', sep = ' ', index_col = 0)
predictors = pd.read_csv('Predictions_with_Continuum.txt', sep = ' ', index_col = 0)

In [ ]:
features_df.head()

In [ ]:
predictors.head()

In [28]:
good_fits_mask = features_df.chisq_phot < 50


EW_r_mask = predictors.EW_r.values < 500

total_mask = good_fits_mask & EW_r_mask

good_fits_data = features_df[total_mask]
y_pred = predictors[total_mask].EW_r

In [ ]:
fig, axes = plt.subplots(2, 2, figsize = (10, 10))

ax = axes.flatten()

cols= ['burst', 'dust:Av', 'stellar_mass', 'sfr']

for column, a in zip(cols, ax):
    sb.boxplot(good_fits_data[column], ax = a)

plt.show()

# 7. Data Analysis

Part of our bread and butter is that we can take in a data set and learn things from it. This is the essence of data analysis where we use the data to uncover trends hidden within the data and we usually use plots and summary statistics to understand what the data is trying to tell us. We will cover some of the data analysis plots and techniques in the next few cells to familiarize yourself with what it means to analyze a data set.

In [ ]:
fig, axes = plt.subplots(2, 2, figsize = (10, 10))

ax = axes.flatten()

cols= ['burst', 'dust:Av', 'stellar_mass', 'sfr']

for column, a in zip(cols, ax):
    a.hist(good_fits_data[column], bins = 30, color = 'purple')
    a.set_xlabel(column)

ax[0].set_ylabel('Counts')
ax[-2].set_ylabel('Counts')

plt.show()

In [ ]:
fig, axes = plt.subplots(2, 2, figsize = (10, 10))

ax = axes.flatten()

cols= ['burst', 'dust:Av', 'stellar_mass', 'sfr']

for column, a in zip(cols, ax):
    a.scatter(good_fits_data[column], y_pred, color = 'purple', alpha = 0.5, s = 10)
    a.set_xlabel(column)

ax[0].set_ylabel('EW_r')
ax[-2].set_ylabel('EW_r')


plt.show()

In [ ]:
good_fits_data[['burst', 'dust:Av', 'stellar_mass', 'sfr']].plot(kind = 'box', 
                                                                 subplots = True, 
                                                                 layout = (2, 2), 
                                                                 figsize = (10, 10))
plt.show()

In [ ]:
plt.figure(figsize = (10, 10))
sb.pairplot(good_fits_data[['burst', 'dust:Av', 'stellar_mass', 'sfr']], corner = True)
plt.show()

In [34]:

corr_matrix = good_fits_data[['burst', 'dust:Av', 'stellar_mass', 'sfr']].corr()

In [ ]:
plt.figure(figsize = (10, 5))
sb.heatmap(corr_matrix, annot = True)
plt.show()